## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:4" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-03T22:43:48.297+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "K8ooE5Gfr2BBZozavlEp31IfnNvDOXfxcwpdnHtT2oU=" -> "5FRlAIvMR5mp0n5hWe9+tyUBasBPDobp5QjHfr0qXHk=" # forces replacement
      ~ source_code_size            = 10310537 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission will be created
  + resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      + action         = "lambda:GetLayerVersion"
      + id             = (known after apply)
      + layer_name     = (known after apply)
      + policy         = (known after apply)
      + principal      = "*"
      + revision_id    = (known after apply)
      + statement_id   = "shared-layer-permission"
      + version_number = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
